//  Задача 5.З клавіатури вводиться назва категорії водія (А-мотоцикл, В-легковий автомобіль, С-вантажний автомобіль). 
//  Вивести на екран назву транспортного засобу, яким він може керувати.
// 1. Описуємо і вводимо значення змінних 
// categoryOfDriver - категорія водія
// 2.Заносимо в switch різні рішення в залежності від введенної категорії та виводимо результат
let categoryOfDriver = prompt("Яка ваша водійска категорія?","A,B,C,D");
switch(categoryOfDriver){
	case "A" : alert("Ви можете керувати мотоціклом")
	break;
	case "B" : alert("Ви можете керувати автомобілем")
	break;
	case "C" : alert("Ви можете керувати вантажівкой")
	break;
	case "D" : alert("Ви можете керувати автобусом")
	break;
	default : alert("Невідома категорія")
	break;
}