// З клавіатури вводиться ціна товару і кількість грошей. Якщо грошей не вистачає то відмовляємо у покупці,
// інакше, якщо ще залишаються гроші, то пропонуємо купити лотерею за 4 грн.
// 1. Описуємо і вводимо значення змінних 
// priceOfProduct  - ціна товару
// amountOfMoney - кількість грошей
let priceOfProduct = parseFloat(prompt("Введіть ціну товара", "0"));
let amountOfMoney = parseFloat(prompt("Введіть кількість грошей","0"));
// 2.Прописуємо умови виконання різних варіантів
if(amountOfMoney < priceOfProduct)
alert("У вас немає грошей на цю покупку!")
else  if ((amountOfMoney - priceOfProduct) >= 4)
alert("Пропонуємо купити лотерейку за 4грн.");
